window.addEventListener("DOMContentLoaded", () => {
    document.querySelector("#text").innerHTML = `
    <div class="row g-3">
    <!-- Заголовки -->
    <div class="col-12">
        <div class="card">
            <div class="card-body">
                <div class="row g-3">
                    <div class="col-12">
                        <h4 class="h4">
                            Система заголовков
                        </h4>
                    </div>
                    <div class="col-12">
                        <h1 class="h-1">Заголовок 1</h1>
                        <h2 class="h-2">Заголовок 2</h2>
                        <h3 class="h-3">Заголовок 3</h3>
                        <h4 class="h-4">Заголовок 4</h4>
                        <h5 class="h-5">Заголовок 5</h5>
                        <h6 class="h-6">Заголовок 6</h6>
                    </div>
                </div>
            </div>
        </div>
    </div>
    
    <!-- Обычный текст -->
    <div class="col-12">
    <div class="card">
    <div class="card-header">
        <h4 class="h4">
                    Обычный текст (параграф)
                </h4>
    </div>
                    <div class="card-body">
        <div class="row g-3">
            <div class="col-12">
                <p>
                    Это прогрессивные специалисты самых разных профилей со всей страны. Находи тех, кто нужен твоему проекту и формируй команду мечты.
                </p>
                <p class="fw-lighter">
                    Это прогрессивные специалисты самых разных профилей со всей страны. Находи тех, кто нужен твоему проекту и формируй команду мечты.
                </p>
                <p class="fw-bold">
                    Это прогрессивные специалисты самых разных профилей со всей страны. Находи тех, кто нужен твоему проекту и формируй команду мечты.
                </p>
                <p class="fw-bolder">
                    Это прогрессивные специалисты самых разных профилей со всей страны. Находи тех, кто нужен твоему проекту и формируй команду мечты.
                </p>
                <hr>
                <p class="fw-100">
                    Это прогрессивные специалисты самых разных профилей со всей страны. Находи тех, кто нужен твоему проекту и формируй команду мечты.
                </p>
                <p class="fw-200">
                    Это прогрессивные специалисты самых разных профилей со всей страны. Находи тех, кто нужен твоему проекту и формируй команду мечты.
                </p>
                <p class="fw-300">
                    Это прогрессивные специалисты самых разных профилей со всей страны. Находи тех, кто нужен твоему проекту и формируй команду мечты.
                </p>
                <p class="fw-400">
                    Это прогрессивные специалисты самых разных профилей со всей страны. Находи тех, кто нужен твоему проекту и формируй команду мечты.
                </p>
                <p class="fw-500">
                    Это прогрессивные специалисты самых разных профилей со всей страны. Находи тех, кто нужен твоему проекту и формируй команду мечты.
                </p>
                <p class="fw-600">
                    Это прогрессивные специалисты самых разных профилей со всей страны. Находи тех, кто нужен твоему проекту и формируй команду мечты.
                </p>
                <p class="fw-700">
                    Это прогрессивные специалисты самых разных профилей со всей страны. Находи тех, кто нужен твоему проекту и формируй команду мечты.
                </p>
                <p class="fw-800">
                    Это прогрессивные специалисты самых разных профилей со всей страны. Находи тех, кто нужен твоему проекту и формируй команду мечты.
                </p>
                <p class="fw-900">
                    Это прогрессивные специалисты самых разных профилей со всей страны. Находи тех, кто нужен твоему проекту и формируй команду мечты.
                </p>
            </div>
            <div class="col-12">
                <p class="text-primary">
                    Это прогрессивные специалисты самых разных профилей со всей страны. Находи тех, кто нужен твоему проекту и формируй команду мечты.
                </p>
                <p class="text-secondary">
                    Это прогрессивные специалисты самых разных профилей со всей страны. Находи тех, кто нужен твоему проекту и формируй команду мечты.
                </p>
                <p class="text-success">
                    Это прогрессивные специалисты самых разных профилей со всей страны. Находи тех, кто нужен твоему проекту и формируй команду мечты.
                </p>
                <p class="text-danger">
                    Это прогрессивные специалисты самых разных профилей со всей страны. Находи тех, кто нужен твоему проекту и формируй команду мечты.
                </p>
                <p class="text-warning">
                    Это прогрессивные специалисты самых разных профилей со всей страны. Находи тех, кто нужен твоему проекту и формируй команду мечты.
                </p>
                <p class="text-black">
                    Это прогрессивные специалисты самых разных профилей со всей страны. Находи тех, кто нужен твоему проекту и формируй команду мечты.
                </p>
                <p class="text-white">
                    Это прогрессивные специалисты самых разных профилей со всей страны. Находи тех, кто нужен твоему проекту и формируй команду мечты.
                </p>
                <p class="text-orange">
                    Это прогрессивные специалисты самых разных профилей со всей страны. Находи тех, кто нужен твоему проекту и формируй команду мечты.
                </p>
                <p class="text-purple">
                    Это прогрессивные специалисты самых разных профилей со всей страны. Находи тех, кто нужен твоему проекту и формируй команду мечты.
                </p>
                <p class="text-blue">
                    Это прогрессивные специалисты самых разных профилей со всей страны. Находи тех, кто нужен твоему проекту и формируй команду мечты.
                </p>
            </div>
        </div>
        </div>
        </div>
    </div>
</div>
  `;
});
